_site/doc/ICC/ICCtheory.org
#+TITLE: Different types of ICC in R

\bigskip
\bigskip

In this document, we will consider measurements done at several
sessions over several individuals. We assume no missing data, i.e.,
all individuals have measurements for all sessions. The question we
would like to answer is what is the reliability of the measurements?

\bigskip

Recommanded references: 
- Kenneth O. McGraw and S. P. Wong *Forming Inferences About Some Intraclass Correlation Coefficients*, Psychological Methods, 1996, Vol. l,No. 1,30-46
- Lawrence Lin, A.S. Hedayat, Wenting Wu, *Statistical Tools for Measuring Agreement*, 2012, Springer. 
\clearpage

* Preparation

** Load R packages
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
library(data.table, quietly = TRUE, verbose = FALSE)
library(lava, quietly = TRUE, verbose = FALSE)
library(lme4, quietly = TRUE, verbose = FALSE)
library(nlme, quietly = TRUE, verbose = FALSE)
library(irr, quietly = TRUE, verbose = FALSE)
library(agRee, quietly = TRUE, verbose = FALSE)
library(psych, quietly = TRUE, verbose = FALSE)
#+END_SRC

#+RESULTS:
#+begin_example
Error in brary(data.table, quietly = TRUE, verbose = FALSE) : 
  could not find function "brary"
Linked to JAGS 4.2.0
Loaded modules: basemod,bugs

Attaching package: 'R2jags'

The following object is masked from 'package:coda':

    traceplot

Error: package or namespace load failed for 'BRugs':
 .onLoad failed in loadNamespace() for 'BRugs', details:
  call: if (!is.na(ob$version)) msg <- paste(msg, "version", ob$version) else msg <- paste(msg, 
  error: argument is of length zero
Error: package 'BRugs' could not be loaded
In addition: Warning messages:
1: package 'agRee' was built under R version 3.4.1 
2: package 'miscF' was built under R version 3.4.1 
3: package 'R2jags' was built under R version 3.4.1 
4: package 'rjags' was built under R version 3.4.1 
5: package 'BRugs' was built under R version 3.4.1 
6: In findOpenBUGS() : OpenBUGS 3.2.2 or greater must be installed
(if so, this indicates missing registry keys of OpenBUGS).
Setting the environment variable 'OpenBUGS_PATH' in advance of loading 'BRugs' overwrites the path.
See ?loadOpenBUGS in order to load OpenBUGS manually.
7: In is.na(ob$version) :
  is.na() applied to non-(list or vector) of type 'NULL'
#+end_example

** Data generation
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
n.id <- 10
n.scan <- 2

set.seed(10)
m <- lvm(c(Ytest,Yretest) ~ 2*eta)
latent(m) <- ~eta
distribution(m, ~Ytest) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(m, ~Yretest) <- lava::gaussian.lvm(mean = 1, sd = 1)

dtW.icc1 <- as.data.table(lava::sim(m, n.id))
dtW.icc1[, eta := NULL]
dtW.icc1[, Id := as.character(1:.N)]
dtL.icc1 <- melt(dtW.icc1, id.vars = "Id", value.name = "Y", variable.name = "session")

dfW.icc1 <- as.data.frame(dtW.icc1)
dfL.icc1 <- as.data.frame(dtL.icc1)

n.rater <- 5

mm <- lvm(c(Y1,Y2,Y3,Y4,Y5) ~ 2*eta)
latent(mm) <- ~eta
distribution(mm, ~Y1) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y2) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y3) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y4) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y5) <- lava::gaussian.lvm(mean = 1, sd = 1)

dtW.icc2 <- as.data.table(lava::sim(mm, n.id))
dtW.icc2[, eta := NULL]
dtW.icc2[, Id := as.character(1:.N)]
dtL.icc2 <- melt(dtW.icc2, id.vars = "Id", value.name = "Y", variable.name = "session")

dfW.icc2 <- as.data.frame(dtW.icc2)
dfL.icc2 <- as.data.frame(dtL.icc2)
#+END_SRC


#+RESULTS:

\clearpage

* ICC1: fixed number of sessions (e.g. test, re-test) assuming no session effect

Using ICC1, we assess the absolute agreement among measurements
repeated over one random factor (here patient identity) assuming no
other effect. The number of sessions is fixed meaning that it is
precisely those sessions that are interesting. 

\bigskip

/Example:/ we want to plan a study to assess treatment efficacy with
two sessions: baseline and post-treatment. EEG is used to measure
treatment efficacy. Prior to this study, another study is performed to
assessed the stability of the EEG measurement between two sessions. We
don't expect systematic difference in EEG signal between the sessions.

\bigskip

ICC1 is equivalent to the following mixed model:

#+BEGIN_EXPORT latex
\begin{equation}
 Y_{i,t} = \alpha + u_{i} + \varepsilon_{i,t} 
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \)  \\
& \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}

\begin{align}
 ICC^{single}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \\
 ICC^{average}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}}
\end{align}
#+END_EXPORT

\bigskip

** using mixed models
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
  lme_ICC1 <- lmer(Y ~ 1 + (1|Id), data = dtL.icc1)

  sigma_id <- attr(VarCorr(lme_ICC1)[[1]],"stddev")
  sigma_error <- attr(VarCorr(lme_ICC1),"sc")

  ICC1.lme <- c(
  single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
  average = as.double(sigma_id^2/(sigma_error^2/n.scan+sigma_id^2))
  )

  ICC1.lme
#+END_SRC

#+RESULTS:
:    single   average 
: 0.5191614 0.6834842

\bigskip

** using generalized least squares
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
gls_ICC1 <- gls(Y ~ 1, correlation = corCompSymm(form = ~ 1|Id), data = dtL.icc1)

# correlation matrix
unclass(cov2cor(getVarCov(gls_ICC1)))
#+END_SRC

#+RESULTS:
:           [,1]      [,2]
: [1,] 1.0000000 0.5191607
: [2,] 0.5191607 1.0000000

# *** using lvm
# #+BEGIN_SRC R :results output :exports both :session *R* :cache no 
# lvm_ICC1 <- lvm(c(Ytest,Yretest) ~ 0+1*eta)
# covariance(lvm_ICC1, ~Ytest) <- "sigma2" # force same variance
# covariance(lvm_ICC1, ~Yretest) <- "sigma2" # force same variance
# latent(lvm_ICC1) <- ~eta

# elvm_ICC1 <- estimate(lvm_ICC1, data = dtW.data)

# summary(elvm_ICC1)
# #+END_SRC

\bigskip

** using anova
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
aov_ICC1 <- aov(Y ~ Error(Id), data = dtL.icc1) 

MSB <- summary(aov_ICC1)[["Error: Id"]][[1]]["Mean Sq"]
MSW <- summary(aov_ICC1)[["Error: Within"]][[1]]["Mean Sq"]

ICC1.aov <-  c(
single = as.double((MSB - MSW)/(MSB + (n.scan-1)*MSW)),
average = as.double((MSB - MSW)/MSB)
)

ICC1.aov
#+END_SRC

#+RESULTS:
:    single   average 
: 0.5191614 0.6834842

\bigskip

** using existing packages
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
# single
cat("single \n")
irr::icc(dfW.icc1[,c("Ytest", "Yretest")],
         model="oneway", type="consistency")$value
psych::ICC(dfW.data[,c("Ytest", "Yretest")])[[1]]$ICC[1]

# average
cat("average \n")
irr::icc(dfW.icc1[,c("Ytest", "Yretest")],
         model="oneway", type="consistency", unit = "average")$value
psych::ICC(dfW.data[,c("Ytest", "Yretest")])[[1]]$ICC[4]
#+END_SRC

#+RESULTS:
: single
: [1] 0.5191614
: [1] 0.5191614
: average
: [1] 0.6834842
: [1] 0.6834842

\clearpage

