_site/doc/ICC/ICCtheory.tex
% Created 2017-07-01 lø 21:54
% Intended LaTeX compiler: pdflatex
\documentclass{article}
               \usepackage{listings}
\usepackage{color}
\usepackage{amsmath}
\usepackage{array}
\usepackage[T1]{fontenc}
\usepackage{natbib}
               \input{1_MathNotations.tex}
\usepackage[top=3cm, bottom=3cm, left=3cm, right=3cm]{geometry}

\lstset{
keywordstyle=\color{blue},
commentstyle=\color{red},stringstyle=\color[rgb]{0,.5,0},
literate={~}{$\sim$}{1},
basicstyle=\ttfamily\small,
columns=fullflexible,
breaklines=true,
breakatwhitespace=false,
numbers=left,
numberstyle=\ttfamily\tiny\color{gray},
stepnumber=1,
numbersep=10pt,
backgroundcolor=\color{white},
tabsize=4,
keepspaces=true,
showspaces=false,
showstringspaces=false,
xleftmargin=.23in,
frame=single,
basewidth={0.5em,0.4em},
}

\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Brice Ozenne}
\date{\today}
\title{Different types of ICC in R}
\hypersetup{
 pdfauthor={Brice Ozenne},
 pdftitle={Different types of ICC in R},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.0.4)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\bigskip
\bigskip

In this document, we will consider measurements done at several
sessions over several individuals. We assume no missing data, i.e.,
all individuals have measurements for all sessions. The question we
would like to answer is what is the reliability of the measurements?

\bigskip

Recommanded references: 
\begin{itemize}
\item Kenneth O. McGraw and S. P. Wong \textbf{Forming Inferences About Some Intraclass Correlation Coefficients}, Psychological Methods, 1996, Vol. l,No. 1,30-46
\item Lawrence Lin, A.S. Hedayat, Wenting Wu, \textbf{Statistical Tools for Measuring Agreement}, 2012, Springer.
\end{itemize}
\clearpage

\section{Preparation}
\label{sec:org26476cb}

\subsection{Load R packages}
\label{sec:orgd6bd315}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
library(data.table, quietly = TRUE, verbose = FALSE)
library(lava, quietly = TRUE, verbose = FALSE)
library(lme4, quietly = TRUE, verbose = FALSE)
library(nlme, quietly = TRUE, verbose = FALSE)
library(irr, quietly = TRUE, verbose = FALSE)
library(psych, quietly = TRUE, verbose = FALSE)
\end{lstlisting}

\subsection{Data generation}
\label{sec:org77f573c}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
n.id <- 10
n.scan <- 2

set.seed(10)
m <- lvm(c(Ytest,Yretest) ~ 2*eta)
latent(m) <- ~eta
distribution(m, ~Ytest) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(m, ~Yretest) <- lava::gaussian.lvm(mean = 1, sd = 1)

dtW.icc1 <- as.data.table(lava::sim(m, n.id))
dtW.icc1[, eta := NULL]
dtW.icc1[, Id := as.character(1:.N)]
dtL.icc1 <- melt(dtW.icc1, id.vars = "Id", value.name = "Y", variable.name = "session")

dfW.icc1 <- as.data.frame(dtW.icc1)
dfL.icc1 <- as.data.frame(dtL.icc1)

n.rater <- 5

mm <- lvm(c(Y1,Y2,Y3,Y4,Y5) ~ 2*eta)
latent(mm) <- ~eta
distribution(mm, ~Y1) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y2) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y3) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y4) <- lava::gaussian.lvm(mean = 1, sd = 1)
distribution(mm, ~Y5) <- lava::gaussian.lvm(mean = 1, sd = 1)

dtW.icc2 <- as.data.table(lava::sim(mm, n.id))
dtW.icc2[, eta := NULL]
dtW.icc2[, Id := as.character(1:.N)]
dtL.icc2 <- melt(dtW.icc2, id.vars = "Id", value.name = "Y", variable.name = "session")

dfW.icc2 <- as.data.frame(dtW.icc2)
dfL.icc2 <- as.data.frame(dtL.icc2)
\end{lstlisting}


\clearpage

\section{ICC1: fixed number of sessions (e.g. test, re-test) assuming no session effect}
\label{sec:org7a5f1c8}

Using ICC1, we assess the absolute agreement among measurements
repeated over one random factor (here patient identity) assuming no
other effect. The number of sessions is fixed meaning that it is
precisely those sessions that are interesting. 

\bigskip

\emph{Example:} we want to plan a study to assess treatment efficacy with
two sessions: baseline and post-treatment. EEG is used to measure
treatment efficacy. Prior to this study, another study is performed to
assessed the stability of the EEG measurement between two sessions. We
don't expect systematic difference in EEG signal between the sessions.

\bigskip

ICC1 is equivalent to the following mixed model:

\begin{equation}
 Y_{i,t} = \alpha + u_{i} + \varepsilon_{i,t} 
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \)  \\
& \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}

\begin{align}
 ICC^{single}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \\
 ICC^{average}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}}
\end{align}

\bigskip

\subsection{using mixed models}
\label{sec:orgc8b4baa}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
lme_ICC1 <- lmer(Y ~ 1 + (1|Id), data = dtL.icc1)

sigma_id <- attr(VarCorr(lme_ICC1)[[1]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC1),"sc")

ICC1.lme <- c(
single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
average = as.double(sigma_id^2/(sigma_error^2/n.scan+sigma_id^2))
)

ICC1.lme
\end{lstlisting}

\begin{verbatim}
   single   average 
0.5191614 0.6834842
\end{verbatim}

\bigskip

\subsection{using generalized least squares}
\label{sec:org2ec4104}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
gls_ICC1 <- gls(Y ~ 1, correlation = corCompSymm(form = ~ 1|Id), data = dtL.icc1)

# correlation matrix
unclass(cov2cor(getVarCov(gls_ICC1)))
\end{lstlisting}

\begin{verbatim}
          [,1]      [,2]
[1,] 1.0000000 0.5191607
[2,] 0.5191607 1.0000000
\end{verbatim}

\bigskip

\subsection{using anova}
\label{sec:org5e331b9}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
aov_ICC1 <- aov(Y ~ Error(Id), data = dtL.icc1) 

MSB <- summary(aov_ICC1)[["Error: Id"]][[1]]["Mean Sq"]
MSW <- summary(aov_ICC1)[["Error: Within"]][[1]]["Mean Sq"]

ICC1.aov <-  c(
single = as.double((MSB - MSW)/(MSB + (n.scan-1)*MSW)),
average = as.double((MSB - MSW)/MSB)
)

ICC1.aov
\end{lstlisting}

\begin{verbatim}
   single   average 
0.5191614 0.6834842
\end{verbatim}

\bigskip

\subsection{using existing packages}
\label{sec:org4216525}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
# single
cat("single \n")
irr::icc(dfW.icc1[,c("Ytest", "Yretest")],
	 model="oneway", type="consistency")$value
psych::ICC(dfW.data[,c("Ytest", "Yretest")])[[1]]$ICC[1]

# average
cat("average \n")
irr::icc(dfW.icc1[,c("Ytest", "Yretest")],
	 model="oneway", type="consistency", unit = "average")$value
psych::ICC(dfW.data[,c("Ytest", "Yretest")])[[1]]$ICC[4]
\end{lstlisting}

\begin{verbatim}
single
[1] 0.5191614
[1] 0.5191614
average
[1] 0.6834842
[1] 0.6834842
\end{verbatim}

\clearpage
