_site/doc/ICC/ICCtheory.tex

\section{ICC3: fixed number of sessions (e.g. test, re-test) accounting for a session effect}
\label{sec:org0aefc87}

Using ICC3, we assess the absolute agreement among measurements
repeated over one random factor (here patient identity) accounting for
a possible session effect. The number of sessions is fixed meaning
that it is precisely those sessions that are interesting.

\bigskip

\emph{Example:} we want to plan a study (called main study) to assess
treatment efficacy with two sessions: baseline and post-treatment. EEG
is used to measure treatment efficacy. Prior to this study, another
study is performed to assessed the stability of the EEG measurement
between two sessions. Unfortunately the two measurements were not
performed using the same EEG machine so we suspect a systematic
difference in EEG signal between the sessions. The investigator will
make sure that this won't happen in the main study. Therefore the
systematic difference is not inherant to the EEG technic (i.e. won't
be observed in the main study).

\bigskip

\emph{Note:}  In test
re-test analysis this should not be the case since we replicate a
measurement under the same conditions.

\bigskip
\bigskip

Using ICC3, we assess the absolute agreement among measurements
repeated over one random factor account for a possible session
effect. Compared to ICC1, this will lead to:
\begin{itemize}
\item a lower \(\sigma^2\) (some of the residual variance is explained)
\item a higher \(\tau\) (individual measurements are better correlated since
there is less arbitrary variation between them)
\item a higher ICC
\end{itemize}

\bigskip

ICC3 is equivalent to the following mixed model:

\begin{equation}
 Y_{i,t} = \alpha + \beta_t t + u_{i} + \varepsilon_{i,t} 
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \)  \\
& \(t\) is treated as a categorical variable \\
& \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}

\begin{align}
 ICC^{single}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \\
 ICC^{average}_{1,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}}
\end{align}

\clearpage

\subsection{using mixed models}
\label{sec:orgc38faac}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
lme_ICC2 <- lmer(Y ~ session + (1|Id), data = dtL.icc1)

sigma_id <- attr(VarCorr(lme_ICC2)[[1]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC2),"sc")

ICC2.lme <- c(
    single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
    average = as.double(sigma_id^2/(sigma_error^2/n.scan+sigma_id^2))
)

ICC2.lme
\end{lstlisting}

\begin{verbatim}
   single   average 
0.7495312 0.8568366
\end{verbatim}

\bigskip

\subsection{using generalized least squares}
\label{sec:org1599827}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
gls_ICC2 <- gls(Y ~ session, correlation = corCompSymm(form = ~ 1|Id), data = dtL.icc1)

# correlation matrix
unclass(cov2cor(getVarCov(gls_ICC2)))
\end{lstlisting}

\begin{verbatim}
          [,1]      [,2]
[1,] 1.0000000 0.7495308
[2,] 0.7495308 1.0000000
\end{verbatim}

\bigskip

\subsection{using anova}
\label{sec:orge56c6fd}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
aov_ICC2 <- aov(Y ~ session + Error(Id), data = dtL.icc1) 

MSB <- summary(aov_ICC2)[["Error: Id"]][[1]]["Mean Sq"]
MSW <- summary(aov_ICC2)[["Error: Within"]][[1]]["Residuals","Mean Sq"]

ICC2.aov <-  c(
    single = as.double((MSB - MSW)/(MSB + (n.scan-1)*MSW)),
    average = as.double((MSB - MSW)/MSB)
)

ICC2.aov
\end{lstlisting}

\begin{verbatim}
   single   average 
0.7495312 0.8568366
\end{verbatim}

\bigskip

\subsection{using existing packages}
\label{sec:org6f62c7d}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
# single
cat("single \n")
psych::ICC(dfW.data[,c("Ytest", "Yretest")])[[1]]$ICC[3]

# average
cat("average \n")
psych::ICC(dfW.data[,c("Ytest", "Yretest")])[[1]]$ICC[6]
\end{lstlisting}

\begin{verbatim}
single
[1] 0.7495312
average
[1] 0.8568366
\end{verbatim}

\section{Heterogenous variance between sessions}
\label{sec:org3e20e15}

The previous ICC are not corrected for a possible difference in
variance between sessions:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
gls_heteroV <- gls(Y ~ session, 
		   weights = varIdent(form = ~ 1|session),
		   correlation = corCompSymm(form = ~ 1|Id), 
		   data = dtL.icc1)

# correlation matrix
unclass(cov2cor(getVarCov(gls_heteroV)))
\end{lstlisting}

\begin{verbatim}
         [,1]     [,2]
[1,] 1.000000 0.763223
[2,] 0.763223 1.000000
\end{verbatim}

In test re-test analysis this should not be the case since we
replicate a measurement under the same conditions.

\clearpage


\section{ICC2: random number of sessions}
\label{sec:org1686ca2}

Using ICC2, we assess the absolute agreement among measurements
repeated over two random factors, e.g. patient identity and
sessions. We don't account for a possible session effect. The number
of sessions is random meaning that we are not precisely interested in
those sessions. A more realistic example would be to consider raters
instead of sessions.

\bigskip

\emph{Example:} we want to study the reliability of the grades given by
teachers. We include 10 teachers that will grade 20 students. We are
not interested in those specific teachers since further studies may be
performed in other schools with other teachers.

\bigskip

ICC2 is equivalent to the following mixed model:
\begin{equation}
Y_{i,j,t} = \alpha + u_{i} + v_{j} + \varepsilon_{i,j,t}
\end{equation}

\begin{tabular}{ll}
where & \(u_{i} \sim \Gaus[0,\tau^2] \) \\
 &  \(v_{j} \sim \Gaus[0,\delta^2] \) \\
 & \(\varepsilon_{i,t} \sim \Gaus[0,\sigma^2] \) \\
\end{tabular}

\begin{align}
 ICC_{2,agreement} &= \frac{\tau^2}{\tau^2 + \sigma^2} \text{ or } ICC_{2,consistency} = \frac{\tau^2}{\tau^2 + \delta^2 + \sigma^2} \\
 ICC^{average}_{2,agreement} &= \frac{\tau^2}{\tau^2 + \frac{\sigma^2}{n}} \text{ or } ICC^{average}_{2,consistency} = \frac{\tau^2}{\tau^2 + \frac{1}{n}(\delta^2 + \sigma^2)}
\end{align}


\bigskip

\subsection{using mixed models}
\label{sec:org6f86828}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
lme_ICC2r <- lmer(Y ~ 1 + (1|session)+ (1|Id), data = dtL.icc2)

sigma_id <- attr(VarCorr(lme_ICC2r)[[1]],"stddev")
sigma_scan <- attr(VarCorr(lme_ICC2r)[[2]],"stddev")
sigma_error <- attr(VarCorr(lme_ICC2r),"sc")

ICC2r.lme <- c(
    consistency.single = as.double(sigma_id^2/(sigma_error^2+sigma_id^2)),
    agreement.single = as.double(sigma_id^2/(sigma_error^2+sigma_scan^2+sigma_id^2)),
    consistency.average = as.double(sigma_id^2/(sigma_error^2/n.rater+sigma_id^2)),
    agreement.average = as.double(sigma_id^2/(sigma_error^2/n.rater+sigma_scan^2/n.rater+sigma_id^2))
)

ICC2r.lme
\end{lstlisting}

\begin{verbatim}
consistency.single    agreement.single consistency.average   agreement.average 
         0.8057232           0.8001849           0.9539944           0.9524334
\end{verbatim}

\clearpage

\subsection{using generalized least squares}
\label{sec:org12779b1}
Don't know how to specify non-nested random effects

\subsection{using anova}
\label{sec:orgca469b2}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
aov_ICC2r <- aov(Y ~ Error(session + Id), data = dtL.icc2) 

MSB <- summary(aov_ICC2r)[["Error: Id"]][[1]]["Mean Sq"]
MSscan <- summary(aov_ICC2r)[["Error: session"]][[1]]["Residuals","Mean Sq"]
MSW <- summary(aov_ICC2r)[["Error: Within"]][[1]]["Residuals","Mean Sq"]

ICC2r.aov <-  c(
    consistency.single = as.double((MSB - MSW)/(MSB + (n.rater-1)*MSW)),
    agreement.single = as.double((MSB - MSW)/(MSB + (n.rater-1)*MSW + n.rater * (MSscan-MSW)/n.id)),
    consistency.average = as.double((MSB - MSW)/MSB),
    agreement.average = as.double((MSB - MSW)/(MSB + (MSscan-MSW)/n.id))
)

ICC2r.aov
\end{lstlisting}

\begin{verbatim}
consistency.single    agreement.single consistency.average   agreement.average 
         0.8057232           0.8001849           0.9539944           0.9524334
\end{verbatim}
