_site/doc/ICC/ICCtheory.org
** using existing packages
#+BEGIN_SRC R :results output :exports both :session *R* :cache no 
# single
cat("single \n")
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
         model="twoway", type="consistency")$value
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
         model="twoway", type="agreement")$value
psych::ICC(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")])[[1]]$ICC[3:2]

# average
cat("average \n")
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
         model="twoway", type="consistency", unit = "average")$value
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
         model="twoway", type="agreement", unit = "average")$value
psych::ICC(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")])[[1]]$ICC[6:5]
#+END_SRC

#+RESULTS:
: single
: [1] 0.8057232
: [1] 0.8001849
: [1] 0.8057232 0.8001849
: average
: [1] 0.9539944
: [1] 0.9524334
: [1] 0.9539944 0.9524334

\clearpage

* Different correlation between sessions

When considering more than 2 sessions, the previous ICC assume the
same correlation between sessions (or raters). This can be relaxed
using an unstructured covariance matrix:

#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
gls_heteroC <- gls(Y ~ session,
                   correlation = corSymm(form = ~ 1|Id),
                   data = dtL.icc3)

# correlation matrix
M.icc <- unclass(cov2cor(getVarCov(gls_heteroC)))
print(M.icc)
#+END_SRC

#+RESULTS:
:           [,1]      [,2]      [,3]      [,4]      [,5]
: [1,] 1.0000000 0.8257162 0.6932362 0.8742870 0.7906416
: [2,] 0.8257162 1.0000000 0.7640218 0.7507234 0.8421196
: [3,] 0.6932362 0.7640218 1.0000000 0.5166739 0.6906413
: [4,] 0.8742870 0.7507234 0.5166739 1.0000000 0.5647855
: [5,] 0.7906416 0.8421196 0.6906413 0.5647855 1.0000000

Note that the mean ICC:
#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R :exports both :results output :session *R* :cache no
mean(setdiff(unique(M.icc),1))
apply(M.icc, 1, function(x){mean(setdiff(x,1))})
#+END_SRC

#+RESULTS:
: [1] 0.7312846
: [1] 0.7959702 0.7956452 0.6661433 0.6766174 0.7220470

does not match the "normal" ICC:
#+ATTR_LATEX: :options otherkeywords={}, deletekeywords={}
#+BEGIN_SRC R :exports both :results output :session *R* :cache yes 
gls_homoC <- gls(Y ~ session,
                 correlation = corCompSymm(form = ~ 1|Id),
                 data = dtL.icc3)

# correlation matrix
unclass(cov2cor(getVarCov(gls_homoC)))
#+END_SRC

#+RESULTS[<2017-07-01 21:42:03> 3d3f2d50fcf8948a66d07163bfa9be8f5e6f8375]:
:           [,1]      [,2]      [,3]      [,4]      [,5]
: [1,] 1.0000000 0.8057232 0.8057232 0.8057232 0.8057232
: [2,] 0.8057232 1.0000000 0.8057232 0.8057232 0.8057232
: [3,] 0.8057232 0.8057232 1.0000000 0.8057232 0.8057232
: [4,] 0.8057232 0.8057232 0.8057232 1.0000000 0.8057232
: [5,] 0.8057232 0.8057232 0.8057232 0.8057232 1.0000000

#+BEGIN_SRC R :exports both :results output :session *R* :cache yes 
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
         model="oneway", type="consistency")$value
#+END_SRC

#+RESULTS[<2017-07-01 21:49:04> b5b0d239f1cdc28f670b3bc9b94e79eb87657c71]:
: [1] 0.7999099

/Note:/ small difference between the function =icc= and
=gls=. Due to non optimal optimization in =gls=?

* Header :noexport:
#+LANGUAGE:  en
#+LaTeX_CLASS: org-article
#+PROPERTY: session *R*
#+LaTeX_HEADER:\input{1_MathNotations.tex}
#+LATEX_HEADER: \usepackage[top=3cm, bottom=3cm, left=3cm, right=3cm]{geometry}
