_site/doc/ICC/ICCtheory.tex

\subsection{using existing packages}
\label{sec:org2880b8e}
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
# single
cat("single \n")
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
	 model="twoway", type="consistency")$value
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
	 model="twoway", type="agreement")$value
psych::ICC(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")])[[1]]$ICC[3:2]

# average
cat("average \n")
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
	 model="twoway", type="consistency", unit = "average")$value
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
	 model="twoway", type="agreement", unit = "average")$value
psych::ICC(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")])[[1]]$ICC[6:5]
\end{lstlisting}

\begin{verbatim}
single
[1] 0.8057232
[1] 0.8001849
[1] 0.8057232 0.8001849
average
[1] 0.9539944
[1] 0.9524334
[1] 0.9539944 0.9524334
\end{verbatim}

\clearpage

\section{Different correlation between sessions}
\label{sec:org0fd120e}

When considering more than 2 sessions, the previous ICC assume the
same correlation between sessions (or raters). This can be relaxed
using an unstructured covariance matrix:

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none,otherkeywords={}, deletekeywords={}}
\begin{lstlisting}
gls_heteroC <- gls(Y ~ session,
		   correlation = corSymm(form = ~ 1|Id),
		   data = dtL.icc3)

# correlation matrix
M.icc <- unclass(cov2cor(getVarCov(gls_heteroC)))
print(M.icc)
\end{lstlisting}

\begin{verbatim}
          [,1]      [,2]      [,3]      [,4]      [,5]
[1,] 1.0000000 0.8257162 0.6932362 0.8742870 0.7906416
[2,] 0.8257162 1.0000000 0.7640218 0.7507234 0.8421196
[3,] 0.6932362 0.7640218 1.0000000 0.5166739 0.6906413
[4,] 0.8742870 0.7507234 0.5166739 1.0000000 0.5647855
[5,] 0.7906416 0.8421196 0.6906413 0.5647855 1.0000000
\end{verbatim}

Note that the mean ICC:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none,otherkeywords={}, deletekeywords={}}
\begin{lstlisting}
mean(setdiff(unique(M.icc),1))
apply(M.icc, 1, function(x){mean(setdiff(x,1))})
\end{lstlisting}

\begin{verbatim}
[1] 0.7312846
[1] 0.7959702 0.7956452 0.6661433 0.6766174 0.7220470
\end{verbatim}

does not match the "normal" ICC:
\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none,otherkeywords={}, deletekeywords={}}
\begin{lstlisting}
gls_homoC <- gls(Y ~ session,
		 correlation = corCompSymm(form = ~ 1|Id),
		 data = dtL.icc3)

# correlation matrix
unclass(cov2cor(getVarCov(gls_homoC)))
\end{lstlisting}

\begin{verbatim}
          [,1]      [,2]      [,3]      [,4]      [,5]
[1,] 1.0000000 0.8057232 0.8057232 0.8057232 0.8057232
[2,] 0.8057232 1.0000000 0.8057232 0.8057232 0.8057232
[3,] 0.8057232 0.8057232 1.0000000 0.8057232 0.8057232
[4,] 0.8057232 0.8057232 0.8057232 1.0000000 0.8057232
[5,] 0.8057232 0.8057232 0.8057232 0.8057232 1.0000000
\end{verbatim}

\lstset{language=r,label= ,caption= ,captionpos=b,numbers=none}
\begin{lstlisting}
irr::icc(dfW.icc2[,c("Y1", "Y2", "Y3", "Y4", "Y5")],
	 model="oneway", type="consistency")$value
\end{lstlisting}

\begin{verbatim}
[1] 0.7999099
\end{verbatim}

\emph{Note:} small difference between the function \texttt{icc} and
\texttt{gls}. Due to non optimal optimization in \texttt{gls}?
\end{document}